[
  {
    "id": "1",
    "title": "Ошибка при загрузке уровня в многопользовательском режиме",
    "text": "Ошибка при загрузке уровня в многопользовательском режиме. После загрузки уровня клиент зависает. При загрузке уровня в многопользовательском режиме клиент зависает сразу после завершения процесса загрузки. Игрок не может продолжить игру, управление становится недоступным, и требуется принудительная перезагрузка клиента. Эта ошибка прерывает игровой процесс для всех участников сессии и делает невозможным проведение многопользовательских матчей. Предполагается, что проблема связана с некорректной синхронизацией данных или сетевыми задержками на этапе загрузки уровня."
  },
  {
    "id": "2",
    "title": "Некорректное отображение текста в диалоговых окнах на некоторых разрешениях экрана",
    "text": "Некорректное отображение текста в диалоговых окнах на некоторых разрешениях экрана. На некоторых разрешениях экрана текст в диалоговых окнах отображается неправильно: строки текста могут обрываться, накладываться друг на друга или выходить за границы выделенных областей. Это приводит к тому, что часть информации становится нечитабельной или вовсе пропадает из поля зрения пользователя. Причиной может быть отсутствие адаптивной верстки интерфейса, который должен автоматически подстраиваться под разные размеры экранов."
  },
  {
    "id": "3",
    "title": "При использовании оружия \"Автоган\" текстуры объекта исчезают, при этом остаются слышны звуки выстрелов",
    "text": "При использовании оружия \"Автоган\" текстуры объекта исчезают, при этом остаются слышны звуки выстрелов. При использовании оружия \"Автомат\" происходит исчезновение текстур самого оружия. Игрок всё ещё слышит звуки выстрелов, но на экране отсутствует визуальная модель оружия, что нарушает восприятие игрового процесса и может вызывать путаницу. Вероятной причиной является ошибка в анимации или рендеринге модели, происходящая в момент активации режима стрельбы."
  },
  {
    "id": "4",
    "title": "При нажатии на кнопку \"Сохранить\" в разделе настроек профиля, изменения не сохраняются",
    "text": "При нажатии на кнопку \"Сохранить\" в разделе настроек профиля, изменения не сохраняются. В разделе настроек профиля после изменения параметров и нажатия кнопки \"Сохранить\" изменения не фиксируются. После перезагрузки страницы или повторного входа в профиль все параметры сбрасываются к предыдущим значениям. Это создает ощущение ненадежной работы системы и может вызывать разочарование у пользователей. Скорее всего, ошибка возникает на этапе отправки или сохранения данных на сервере."
  },
  {
    "id": "5",
    "title": "При попытке загрузить изображение в профиль, система не обрабатывает файлы",
    "text": "При попытке загрузить изображение в профиль, система не обрабатывает файлы. При попытке загрузить новое изображение в профиль система не обрабатывает загружаемый файл. Изображение не появляется, при этом пользователю не всегда предоставляется информация о причине неудачи. Такая проблема мешает персонализации профиля и портит пользовательский опыт. Возможной причиной является сбой при валидации файла или ошибка передачи данных на сервер для обработки изображения."
  }
]